cf/Documents/Новость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Новость</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧистыйHTML</Name>
					<Comment>значит форматированный документ идет в баню</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/ТоварыПоставщиковВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыПоставщиковВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПрайса</Name>
					<Comment>кода устоновили цену в навижене</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/Новинки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Новинки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНовинок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Готовность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Готовность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Documents/Новость/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем стСтраница;

&НаСервере
Процедура ПрочитатьТекст(ТекущийОбъект)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = РеквизитФормыВЗначение("Объект"); КонецЕсли;
	
	Вложения = Новый Структура;
	
	Для Каждого Строка Из ТекущийОбъект.Вложения Цикл  Вложения.Вставить(Строка.Ключ, Строка.Картинка.Получить());КонецЦикла;
	
	Текст.УстановитьHTML(ТекущийОбъект.Текст, Вложения);
	
КонецПроцедуры
&НаСервере
Процедура СохранитьТекст(ТекущийОбъект)
	
	Перем стрВложения, новТекстHTML;
	
	ТекущийОбъект.Вложения.Очистить();
	Текст.ПолучитьHTML(новТекстHTML, стрВложения);
	
	Инд = -1;
	Для КАждого Элемент Из стрВложения ЦИкл Инд = Инд + 1;
		
		НовСтрока = ТекущийОбъект.Вложения.Добавить();
		
		новКлюч = "img" + формат(Инд, "ЧГ=");
		
		НовСтрока.Ключ 		= новКлюч;
		НовСтрока.Картинка 	= Новый ХранилищеЗначения(Элемент.Значение);
		
		// Подменим ключ в тексте для уникальности
		
		новТекстHTML = СтрЗаменить(новТекстHTML, "<img src='" + Элемент.Ключ + "'", "<img src='" + новКлюч + "'"); КонецЦикла;
	
	ТекущийОбъект.Текст = новТекстHTML;
	
КонецПроцедуры
&НаСервере
Процедура ПреобразоватьДокументВHTML()
	
	Перем стрВложения;
	
	структураАдресовКартинок = Новый Структура;
	
	Текст.ПолучитьHTML(ТекстHTML, стрВложения);
	
	Для Каждого Элемент Из стрВложения Цикл 
		
		Адрес = ПоместитьВоВременноеХранилище(Элемент.Значение); 
		структураАдресовКартинок.Вставить(Элемент.Ключ, Адрес);
		ТекстHTML = СтрЗаменить(ТекстHTML, Элемент.Ключ, Адрес); КонецЦикла;
	
	АдресаКартинок = ЗначениеВСтрокуВнутр(структураАдресовКартинок);
	
КонецПроцедуры
&НаСервере
Процедура ПреобразоватьHTMLВДокумент()
	
	Вложения 		= Новый Структура;
	новТекстHTML 	= ТекстHTML;
	
	Если Не ПустаяСтрока(АдресаКартинок) Тогда
		
		структураАдресовКартинок = ЗначениеИзСтрокиВнутр(АдресаКартинок);
		Для Каждого Элемент Из структураАдресовКартинок Цикл 
			
			новТекстHTML = СтрЗаменить(новТекстHTML, Элемент.Значение, Элемент.Ключ);
			Вложения.Вставить(Элемент.Ключ, ПолучитьИзВременногоХранилища(Элемент.Значение)); КонецЦикла; КонецЕсли;
	
	Текст.УстановитьHTML(новТекстHTML, Вложения);
	
КонецПроцедуры

// ВВОД НА ОСНОВАНИИ (ЧАСТНЫЕ НОВОСТИ)

#Область Формиррование_HTML

&НаСервере
Функция ПолучитьСостояниеТовара(Номенклатура)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ Номенклатура, СУММА(Ожидается) Ожидается, СУММА(Заказано) Заказано, МАКСИМУМ(Цена) Цена ИЗ
	|(
	|	ВЫБРАТЬ Номенклатура, КоличествоОстаток Ожидается, 0 Заказано,0 Цена
	|	ИЗ РегистрНакопления.ТоварыПоставщиковВПути.Остатки(,Номенклатура = &Номенклатура)
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ Номенклатура, 0 , КоличествоОстаток, 0
	|	ИЗ РегистрНакопления.ЗаказыПоставщикам.Остатки(,Номенклатура = &Номенклатура)
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ Номенклатура, 0 , 0, Цена
	|	ИЗ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(,Номенклатура = &Номенклатура И ТипЦен = &ТипЦенРозница)
	|) Запрос
	|СГРУППИРОВАТЬ ПО Номенклатура
	|");
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТипЦенРозница", ОбщиеФункции.ПолучитьЗначениеКонстантыВОбласти("ТипЦенРозница"));
	
	Структура = Новый Структура("Дата, Ожидается, Заказано, Цена", ТекущаяДата(), 0,0,0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, Выборка); КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

#Область v1

&НаСервере
Функция ПолучитьТекстНовинкиТовара_v1(Товар)
	
	текТекстHTML = "";
	
	// Название товара
		
	текТекстHTML = текТекстHTML + "<h3>" + Строка(Товар) + "</h3>" + Символы.ПС;
		
	// Картинка
		
	СсылкаНаКартинку = Картинки.ПолучитьНавигационнуюСсылкуОсновногоИзображения(Товар);
	Если СсылкаНаКартинку <> "" Тогда
		текТекстHTML = текТекстHTML + "<img src='" + СсылкаНаКартинку + "' align=""left""/>" + Символы.ПС; КонецЕсли;
		
	// Артикул
		
	текТекстHTML = текТекстHTML + "Артикул: <b>" + Товар.Артикул + "</b>" + Символы.ПС;
		
	// Ссылки в справочнике
		
	текТекстHTML = текТекстHTML + "<p><a href='v8:Выполнить код:ОткрытьФорму(""Справочник.Номенклатура.ФормаСписка"", Новый Структура(""ТекущаяСтрока"", HTMLОбработкаСервер.ПолучитьОбъектПоГуидСтроке(""Справочники.Номенклатура"", """ + Строка(Товар.УникальныйИдентификатор()) + """)));'>Перейти в справочник номенклатуры</a></p>" + Символы.ПС;
		
	// Ссылки на сайте
		
	Если Товар.ВыгружатьНаСайт И Не ПустаяСтрока(Товар.alies_ru) Тогда
			текТекстHTML = текТекстHTML + "<p><a href='http://www.garagetools.ru/shop/" + Товар.alies_ru + "'>Ссылка товара на сайте</a></p>" + Символы.ПС; КонецЕсли;
		
	// Состояние
		
	Состояние = ПолучитьСостояниеТовара(Товар);
		
	текТекстHTML = текТекстHTML + "
		|<table>
		|<tr><td>На " + Состояние.Дата + "</td><td></td></tr>
		|<tr><td></td><td>" + ?(Состояние.Ожидается, "Ожидается " + Состояние.Ожидается,"Нет в инвойсах") + "</td></tr>
		|<tr><td></td><td>" + ?(Состояние.Заказано, "Заказано " + Состояние.Заказано, "У поставщика не заказан") + "</td></tr>
		|<tr><td></td><td>" + ?(Состояние.Цена, "Розничная цена " + Состояние.Цена + " руб","Не установлена розничная цена") + "</td></tr>
		|</table>" + Символы.ПС;
		
	// Описание
		
	Если Товар.Описание <> "" Тогда
		текТекстHTML = текТекстHTML + "<p>" + Товар.Описание + "</p>" + Символы.ПС;; КонецЕсли;
		
	Возврат текТекстHTML;
	
КонецФункции
&НаСервере
Процедура СформироватьТекст_НовинкиНоменклатуры_v1(Товары)
	
	// Заголовок
	
	ТекстHTML = "<h2>" + ?(Товары.Количество() > 1, "Новинки", "Новинка") + "</h2>" + Символы.ПС;
	
	Для Каждого Товар Из Товары Цикл ТекстHTML = ТекстHTML + ПолучитьТекстНовинкиТовара_v1(Товар) КонецЦикла;
	
	ТекстHTML = "<html>
	|<head>
	|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=EmulateIE7"" />
	|<style type=""text/css"">
	//|body{margin:0px;padding:8px;overflow:hidden;width:100%;height:100%;}
	|body{margin:0px;padding:8px;width:100%;height:100%;}
	|p{line-height:1.15;margin:0px;}
	|ol,ul{margin-top:0px;margin-bottom:0px;}
	|img{border: none;}
	|</style>
	|</head>
	|" + ТекстHTML + "
	|</body>
	|</html>";

	Объект.ЧистыйHTML = Истина;
	
КонецПроцедуры
&НаСервере
Процедура СформироватьТекст_Новинки_v1(Новинки)
	
	// Заголовок
	
	ТекстHTML = "<h2>" + Новинки + "</h2>" + Символы.ПС;
	
	Для Каждого Строка Из Новинки.Товары Цикл ТекстHTML = ТекстHTML + ПолучитьТекстНовинкиТовара_v1(Строка.Номенклатура) КонецЦикла;
	
	ТекстHTML = "<html>
	|<head>
	|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=EmulateIE7"" />
	|<style type=""text/css"">
	//|body{margin:0px;padding:8px;overflow:hidden;width:100%;height:100%;}
	|body{margin:0px;padding:8px;width:100%;height:100%;}
	|p{line-height:1.15;margin:0px;}
	|ol,ul{margin-top:0px;margin-bottom:0px;}
	|img{border: none;}
	|</style>
	|</head>
	|" + ТекстHTML + "
	|</body>
	|</html>";

	Объект.ЧистыйHTML = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область v2

&НаСервере
Функция ПолучитьТекстНовинкиТовара_v2(Товар, ТипЦеныРозница, ВалютаРуб, ПутьКМагазу, Ном)
	
	текТекстHTML = "<tr" + ?(Ном%2, " class=""newgray""", "") + ">
	|";
	
	// Картинка
		
	СсылкаНаКартинку = Картинки.ПолучитьНавигационнуюСсылкуОсновногоИзображения(Товар);
	
	Если Товар.ВыгружатьНаСайт Тогда
		текТекстHTML = текТекстHTML + "<td class=""newtd"" align=""center""><a href='" + ПутьКМагазу + Товар.alies + "'><img src='" + ?(СсылкаНаКартинку = "", "e1cib/data/Справочник.Картинки.Картинка?ref=88490015175303fd11e2b171d9f2fbcd", СсылкаНаКартинку) + "'  width='100' height='100'></a></td>" + Символы.ПС;
	Иначе
		текТекстHTML = текТекстHTML + "<td class=""newtd"" align=""center""><img class=""product_avatar"" src='" + ?(СсылкаНаКартинку = "", "e1cib/data/Справочник.Картинки.Картинка?ref=88490015175303fd11e2b171d9f2fbcd", СсылкаНаКартинку) + "'  width='100' height='100'></td>" + Символы.ПС; КонецЕсли;
		
	// Название
		
	текТекстHTML = текТекстHTML + "<td class=""newtd"" align=""center""><strong><font size=4>" + Товар.Артикул + "</font></strong><br><a href='v8:Выполнить код:ОткрытьФорму(""Справочник.Номенклатура.ФормаСписка"", Новый Структура(""ТекущаяСтрока"", HTMLОбработкаСервер.ПолучитьОбъектПоГуидСтроке(""Справочники.Номенклатура"", """ + Строка(Товар.УникальныйИдентификатор()) + """)));'>" + Строка(Товар) + "</a></td>" + Символы.ПС;
	
	// Описание
	
	текТекстHTML = текТекстHTML + "<td class=""newtd"">" + ?(ПустаяСтрока(Товар.Описание)," нет описания", Товар.Описание) + "</td>" + Символы.ПС;
	
	// Цена
	
	текТекстHTML = текТекстHTML + "<td class=""newtd"" align=""right""><strong><font color=#00B000 size=5>" + РаботаСНоменклатурой.ПолучитьЦену(Товар, ТипЦеныРозница, ВалютаРуб) + "р.</font></strong></td>" + Символы.ПС;
		
	Возврат текТекстHTML + "</tr>";
	
КонецФункции
&НаСервере
Функция Получитьhtml_v2(ТекстЗаголовка, ТекстТаблицы)
	
	Возврат "<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<META name=GENERATOR content=""MSHTML 9.00.8112.16476"">
	// Указываем явное совмещение с 9 эксплоером
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=9"">
	|<style>
	|.newtable{
	|	border-collapse:collapse;
	|}
	|.newth {
	|	padding:10px;
	|	border-bottom:1px solid black;
	|	border-top:1px solid black;
	|}
	|.newtd {
	|	padding:10px;
	|	border-bottom:1px solid #cccccc;
	|}
	|.newgray {
	|	background-color:#F5F5F5;
	|}  
	|</style>

	|</HEAD>
	
	// Тело
	
	|<BODY>
	|" + ТекстЗаголовка + "
	|<table class=""newtable"" width=""100%"">
	//|<caption align=""top""><h3>Изменились розничные цены на следующие товары</h3></caption>
	
	// Шапка
	
	|<tr>
	|<td class=""newtd"" width=120 align=""center"">Картинка</td>
	|<td class=""newtd"" width=120 align=""center"">Товар</td>
	|<td class=""newtd"" align=""center"">Описание</td>
	|<td class=""newtd"" width=80 align=""center"">Розничная<br>цена</td>
	|</tr>

	// Строки
	
	|" + ТекстТаблицы + "
	|</table>
	|</body>
	|</html>";
	
КонецФункции
&НаСервере
Процедура СформироватьТекст_НовинкиНоменклатуры_v2(Товары)
	
	// Заголовок
	
	ТекстЗаголовка	 	= "<h2>" + ?(Товары.Количество() > 1, "Новинки", "Новинка") + "</h2>" + Символы.ПС;
	ТекстТаблицы 		= "";
	ТипЦеныРозница		= ОбщиеФункции.ПолучитьЗначениеКонстантыВОбласти("ТипЦенРозница");
	ВалютаРуб			= Справочники.Валюты.НайтиПоКоду("643");
	ПутьКМагазу			= Константы.ПутьИнтернетМагазин.Получить();
	
	Ном = 0;
	Для Каждого Товар Из Товары Цикл Ном = Ном + 1; ТекстТаблицы = ТекстТаблицы + ПолучитьТекстНовинкиТовара_v2(Товар, ТипЦеныРозница, ВалютаРуб, ПутьКМагазу, Ном) КонецЦикла;
	
	ТекстHTML = Получитьhtml_v2(ТекстЗаголовка, ТекстТаблицы);
	
	Объект.ЧистыйHTML = Истина;
	
КонецПроцедуры
&НаСервере
Процедура СформироватьТекст_Новинки_v2(Новинки)
	
	// Заголовок
	
	ТекстЗаголовка 		= "<h2>" + Новинки + "</h2>
	|<p style=""text-align:right""><a href='V8:ВЫПОЛНИТЬ КОД:ОткрытьФорму(""Справочник.Новинки.Форма.ВсеНовинки"")'>Открыть новинки списком</a></p>
	|";
	ТекстТаблицы 		= "";
	ТипЦеныРозница		= Константы.ТипЦенРозница.Получить();
	ВалютаРуб			= Справочники.Валюты.НайтиПоКоду("643");
	ПутьКМагазу			= Константы.ПутьИнтернетМагазин.Получить();
	
	Ном = 0;
	Для Каждого Строка Из Новинки.Товары Цикл Если Строка.Готовность Тогда Ном = Ном + 1; ТекстТаблицы = ТекстТаблицы + ПолучитьТекстНовинкиТовара_v2(Строка.Номенклатура,  ТипЦеныРозница, ВалютаРуб, ПутьКМагазу, Ном) КонецЕсли; КонецЦикла;
	
	ТекстHTML = Получитьhtml_v2(ТекстЗаголовка, ТекстТаблицы);
	
	Объект.ЧистыйHTML = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Типовые

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ЧистыйHTML Тогда
		ТекущийОбъект.Текст = ТекстHTML;
	Иначе
		СохранитьТекст(ТекущийОбъект); КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не Объект.ЧистыйHTML Тогда
		ПрочитатьТекст(ТекущийОбъект); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если стСтраница = Неопределено Или стСтраница = Элементы.СтраницаДокумент Тогда
		
		ПреобразоватьДокументВHTML();
		
	ИначеЕсли стСтраница = Элементы.СтраницаРедактированиеHTML Тогда
		
		ПреобразоватьHTMLВДокумент(); КонецЕсли;
	
	// Запомним
	
	стСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если 	Объект.Ссылка.Пустая() Тогда
		
		Если Параметры.Новинки.Количество() Тогда			
			СформироватьТекст_НовинкиНоменклатуры_v2(Параметры.Новинки.ВыгрузитьЗначения());
			
		ИначеЕсли Не Параметры.НовинкиСправочник.Пустая() Тогда
			СформироватьТекст_Новинки_v2(Параметры.НовинкиСправочник); КонецЕсли; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
	
	Элементы.СтраницаДокумент.Доступность 			= Не Объект.ЧистыйHTML;
	//Элементы.СтраницаПросмотрHTML.Доступность 		= Объект.ЧистыйHTML;
	Элементы.СтраницаРедактированиеHTML.Доступность = Объект.ЧистыйHTML;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ЧистыйHTML Тогда // установим страницу просмотра HTML если это не форматированный документ
		
		стСтраница 	= Элементы.СтраницаПросмотрHTML;
		Элементы.Страницы.ТекущаяСтраница = стСтраница; 
		
		Если ТекстHTML = "" Тогда
			ТекстHTML = Объект.Текст; КонецЕсли;КонецЕсли;
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

#КонецОбласти

// ЭЛЕМЕНТЫ

&НаКлиенте
Процедура ЧитыйHTMLПриИзменении(Элемент)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПросмотраHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	HTMLОбработкаКлиент.ТекстHTMLПриНажатии(ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

// ДОП УПРАВЛЕНИЕ ТЭГАМИ

&НаКлиенте
Процедура УстановитьТекстВHTML(сНач, кНач, сКон, кКон, Текст)
	
	ЧислоСтрок 	= СтрЧислоСтрок(ТекстHTML);
	НовТекст	= "";
	
	Для Ном = 1 По ЧислоСтрок Цикл Строка = СтрПолучитьСтроку(ТекстHTML, Ном);
		
		Если Ном < сНач Или Ном > сКон Тогда
			
			НовТекст = НовТекст + Строка;
			
		Иначе
			
			НовТекст = НовТекст + Лев(Строка, кНач - 1) + ?(Ном = сНач, Текст, "") + Прав(Строка, СтрДлина(Строка) - кКон + 1); КонецЕсли; 
		
		НовТекст = НовТекст + ?(Ном = ЧислоСтрок, "", Символы.ПС);КонецЦикла;
	
	ТекстHTML = НовТекст;
	Элементы.ТекстРедактированияHTML.УстановитьГраницыВыделения(сНач, кНач, сНач, кНач);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКоординаты()
	
	сНач = 0; сКон = 0; кНач = 0; кКон = 0;
	Элементы.ТекстРедактированияHTML.ПолучитьГраницыВыделения(сНач, кНач, сКон, кКон);
	
	Возврат Новый Структура("сНач, сКон, кНач, кКон", сНач, сКон, кНач, кКон);
	
КонецФункции
//////////////////
&НаКлиенте
Функция ВыбратьТоварПользователемИПолучитьКоординаты()
	
	ВыбНоменклатура = ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ОбработатьВыборТовараПользователемИПолучиниеКоординат",ЭтаФорма,));
КонецФункции
&НаКлиенте
Процедура ОбработатьВыборТовараПользователемИПолучиниеКоординат(Результат, Параметры) Экспорт
	Если Результат <> Неопределено Тогда		
		Структура = ПолучитьКоординаты();
		Структура.Вставить("Номенклатура", Результат); 
		//////////////////////////////////			
		Если Структура <> Неопределено Тогда
			Картинка = картинки.ПолучитьСсылкуОсновногоИзображения(Структура.Номенклатура);
			Если Картинка = Неопределено Тогда ПоказатьПредупреждение(,"Нет картинки",,"Предупреждение"); Возврат; КонецЕсли;			
			УстановитьТекстВHTML(Структура.сНач, Структура.кНач, Структура.сКон, Структура.кКон, "<img src='" + ПолучитьНавигационнуюСсылку(Картинка, "Аватар") + "' align=""left""/>"); КонецЕсли;
		///////////////////////////
	КонецЕсли;	
КонецПроцедуры
//////////////////
&НаКлиенте
Процедура ОткрытьСправочникКартинок(Команда)
	
	ОткрытьФорму("Справочник.Картинки.ФормаСписка",, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры
///
&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	ВыбрКартинка = ОткрытьФорму("Справочник.Картинки.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ОбработкаДобавитьКартинку",ЭтаФорма,));
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаДобавитьКартинку(Результат, Параметр) Экспорт
		Если Результат <> Неопределено Тогда Выбор = ПолучитьКоординаты();
		УстановитьТекстВHTML(Выбор.сНач, Выбор.кНач, Выбор.сКон, Выбор.кКон, "<img src='" + ПолучитьНавигационнуюСсылку(Результат, "Картинка") + "'/>"); КонецЕсли;	
КонецПроцедуры
///
&НаКлиенте
Процедура ВставитьТэгАватараНоменклатуры(Команда)
	Выбор = ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ОбработатьВыборТовараПользователемИПолучиниеКоординат",ЭтаФорма,));
КонецПроцедуры
&НаКлиенте
Процедура ТэгСпискаСПозиционированием(Команда)
	
	Выбор = ВыбратьТоварПользователемИПолучитьКоординаты();
	Если Выбор <> Неопределено Тогда
		
		УстановитьТекстВHTML(Выбор.сНач, Выбор.кНач, Выбор.сКон, Выбор.кКон, "<a href='v8:Выполнить код:ОткрытьФорму(""Справочник.Номенклатура.ФормаСписка"", Новый Структура(""ТекущаяСтрока"", HTMLОбработкаСервер.ПолучитьОбъектПоГуидСтроке(""Справочники.Номенклатура"",""" + Строка(Выбор.Номенклатура.УникальныйИдентификатор()) + """)));'>" + Элементы.ТекстРедактированияHTML.ВыделенныйТекст + "</a>"); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ТэгКарточкиТовара(Команда)
	
	Выбор = ВыбратьТоварПользователемИПолучитьКоординаты();
	Если Выбор <> Неопределено Тогда
		
		УстановитьТекстВHTML(Выбор.сНач, Выбор.кНач, Выбор.сКон, Выбор.кКон, "<a href='v8:Выполнить код:ОткрытьФорму(""Справочник.Номенклатура.ФормаОбъекта"", Новый Структура(""Ключ"", HTMLОбработкаСервер.ПолучитьОбъектПоГуидСтроке(""Справочники.Номенклатура"",""" + Строка(Выбор.Номенклатура.УникальныйИдентификатор()) + """)));'>" + Элементы.ТекстРедактированияHTML.ВыделенныйТекст + "</a>"); КонецЕсли;
	
	
КонецПроцедуры
&НаСервере
Функция ПутьТовараВИнтернетМагазине(Номенклатура)
	
	Возврат Константы.ПутьИнтернетМагазин.Получить() + Номенклатура.alies_ru;
	
КонецФункции
&НаКлиенте
Процедура ТэгТовараВИнтернете(Команда)
	
	Выбор = ВыбратьТоварПользователемИПолучитьКоординаты();
	Если Выбор <> Неопределено Тогда
		
		УстановитьТекстВHTML(Выбор.сНач, Выбор.кНач, Выбор.сКон, Выбор.кКон, "<a href='" + ПутьТовараВИнтернетМагазине(Выбор.Номенклатура) + "'>" + Элементы.ТекстРедактированияHTML.ВыделенныйТекст + "</a>"); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьОбычнуюСсылку(Команда)
	
	Строка = "";
	Если ВвестиСтроку(Строка, "Адрес в интернете:") Тогда
		
		Выбор = ПолучитьКоординаты();
		УстановитьТекстВHTML(Выбор.сНач, Выбор.кНач, Выбор.сКон, Выбор.кКон, "<a href='" + Строка + "'>" + Элементы.ТекстРедактированияHTML.ВыделенныйТекст + "</a>"); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовинкиСписком(Команда)
	ОткрытьФорму("Справочник.Новинки.Форма.ВсеНовинки");
КонецПроцедуры
